Revit 2026 API

# EnergyAnalysisConstructionAbsorptance Property

---

The absorptance value of the construction.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Absorptance { get; }
```
```vb
Public ReadOnly Property Absorptance As Double
	Get
```
```cpp
public:
property double Absorptance {
	double get ();
}
```
```fsharp
member Absorptance : float with get
```

#### Property Value

Double

The absorptance is 0 when no value is found.

#### Reference

EnergyAnalysisConstruction Class

Autodesk.Revit.DB.Analysis Namespace